[{"Message-ID": "<23811856.1075860785239.JavaMail.evans@thyme>", "Date": "Tue, 3 Feb 2004 18:13:05 -0800 (PST)", "From": "consumercare@autobytel.com", "To": "geoff.storey@enron.com", "Message": "\n\nTO        : Geof Storey, Houston, TX\nE-MAIL    : geoff.storey@ubswenergy.com\nCUSTOMER #: 8035003\n\nDear Geof,\n\nAutobytel.com Customer Service would like to thank you for selecting our company to assist with your request for a 2002 Lexus IS 300.  \n\nYour request has been assigned to the following Autobytel.com Accredited Dealer:\n\n*** Westside Lexus ***  in Houston, TX.\n\nWestside Lexus will provide you with a pleasant buying experience and a great value.  The trained Autobytel.com Manager at Westside Lexus, that will be contacting you shortly*, is Gary Cohen.\n\nShould you require assistance before then, please phone Gary Cohen at (281) 558-3030.  If you do contact the dealership, it is important that you speak with Gary Cohen or another trained Autobytel.com Manager to ensure you are receiving our unique and specialized service.\n\nIf you have not already done so, please visit our Finance Center. Autobytel.com can help you save time and money on your vehicle transaction with fast quotes and guaranteed customer service, courtesy of E-LOAN.  Point your browser at http://www.autobytel.com/links.cfm?page=102\n\nIt is important to us that you have a quality experience.  Please ask for our assistance if you have not heard from the dealer within two business days of sending in your purchase request, or if any of your other expectations have not been met.\n\nYou may reach your Customer Service Specialist by e-mailing: ConsumerCare@autobytel.com, or by phone at (888) 422-8999.\n\nSincerely,\n\nAutobytel.com Customer Service \n\n*If you did not submit a purchase request through autobytel.com, we apologize for sending this e-mail in error.  Please reply to this message and type \"REMOVE\" in the subject line of the e-mail.  We will remove your e-mail address from our files within five business days, and you will not receive any further correspondence pertaining to this purchase request.\n\nSewell Lexus: Dallas, TX - Contact Roger Yiu at (214) 353-2010\nWestside Lexus: Houston, TX - Contact Gary Cohen at (281) 558-3030\nPark Place Lexus of Grapevine: Grapevine, TX - Contact Thurman Bryant at (817) 416-3313\nNorth Park Lexus: San Antonio, TX - Contact Tom Murders at (210) 308-8900\nPark Place Lexus: Plano, TX - Contact Dawn Betrus at (972) 407-7082\nLexus of Clear Lake: Friendswood, TX - Contact Joe Herran at (281) 853-141"}, {"Message-ID": "<10436771.1075845350319.JavaMail.evans@thyme>", "Date": "Fri, 30 Mar 2001 13:16:00 -0800 (PST)", "From": "jeff.pearson@enron.com", "To": "geoff.storey@enron.com", "Message": "\nI have updated the forecast to reflect TCPL delays until Nov 1.\n\n  "}, {"Message-ID": "<22034166.1075841594464.JavaMail.evans@thyme>", "Date": "Wed, 6 Feb 2002 06:55:03 -0800 (PST)", "From": "d..hogan@enron.com", "To": "d..hogan@enron.com, lisa.kinsey@enron.com, h..lewis@enron.com, \n\tsouad.mahmassani@enron.com, vladi.pimenov@enron.com, \n\ts..shively@enron.com, geoff.storey@enron.com, \n\ttrading <.williams@enron.com>, bryant.frihart@enron.com, \n\tdeirdre.mccaffrey@enron.com, l..mims@enron.com", "Message": "\nIf you have any questions, please call Lisa Kinsey @ x37628.\n\nThank you,\n\nIrena Hoga"}]